---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegral
source: html/94694d51-8100-5f86-4202-e53165d0daef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateCorniceIntegral Property

Could not create integral wall sweep for wall instance. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateCorniceIntegral { get; }
```